tutorial/sixDoF_2D/overset/background/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    oversetPatch
    {
        patchType       overset;
        type            zeroGradient;
    }

    stationaryWalls
    {
        type            noSlip;
		//type            pressureInletOutletVelocity;
        //value           uniform (0 0 0);
    }
	
    inlet
    {
        type            waveVelocity;
        waveDictName    waveProperties;
        value           uniform (0 0 0);
    }
	
    outlet
    {
        type            waveVelocity;
        waveDictName    waveProperties;
        value           uniform (0 0 0);
    }
	
    sidePatch
    {
        type            empty;
    }

    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    floatingObject
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
